      *Mi primer codigo Hola mundo RPG v2
     D Msg             S             10
      *      
     C                   EVAL      Msg='Hola Mundo'
     C         Msg       DSPLY                   
      * Linea comentario
     C                   SETON                                        LR
	 
	 
	 