      *Mi primer codigo Hola mundo RPG
     D Msg             S             10
      *      
     C                   EVAL      Msg='Hola Mundo'
     C                   DSPLY                   Msg
      * Linea comentario
     C                   SETON                                        LR 